{
  "welcome": "Is not an error, is an opportunity to improve my code",
  "welcome-btn": "View my work",
  "rol": "WEB DEVELOPER",
  "phrase": "I am excited to discover new opportunities and bring my knowledge and experience to the world of web development. I am ready to take on any challenge and contribute to the success of your next project!",
  "about1": "Hello! I am a passionate web developer with 4 years of experience, specializing in creating dynamic and efficient web applications. Throughout my career, I have been involved in numerous collaborative projects, excelling in the development of messaging and parcel systems, as well as implementing e-commerce platforms.",
  "about2": "My expertise centers around using advanced technologies such as Laravel and Vue.js, enabling me to develop robust and scalable web solutions. I am characterized by being empathetic and responsible, always seeking new challenges and opportunities to continue learning and improving my skills.",
  "cv_text": "Mostrar CV",
  "links": {
    "about": {"name":"about", "text": "About", "href": "#about" },
    "experience": {"name":"experience", "text": "Experience", "href": "#experience" },
    "works": {"name":"projects", "text": "Projects", "href": "#projects" },
    "technologies": {"name":"technologies", "text": "Technologies I Use", "href": "#technologies" },
    "certificates": { "name":"certificates","text": "Certificates", "href": "#certificates" },
    "cv": {"name":"cv", "text": "Show CV", "href": "/David_Villeda_CV_ES.pdf", "target": "_blank" }
  },
  "certificates":{
    "certificate": "Certificate",
    "course": "Course",
    "microsoft": {
      "az900": {
        "title": "Microsoft Certified: Azure Fundamentals AZ-900",
        "description": "This certificate validates my knowledge of the fundamental concepts of cloud computing and Microsoft Azure services"
      }
    },
    "mercatitlan": {
      "google-ads": {
        "title": "Google Ads Course",
        "description": "Juan Lombana's Google Ads online course teaches everything from basic concepts to advanced advertising strategies on Google. It covers the creation and optimization of campaigns, effective use of keywords, and structuring ads to maximize return on investment."
      }
    }
  },
  "skills": {
    "test": "Testing",
    "version-control": "Version control",
    "deploy": "Deploy"
  },
  "language": {
    "english": "English",
    "spanish": "Spanish"
  }
}