{
  "welcome": "No es un error, es una oportunidad de mejorar mi codigo",
  "welcome-btn": "Ver mi trabajo",
  "rol": "DESARROLLADOR WEB",
  "phrase": "¡Ansioso por abrazar nuevas oportunidades y desafíos, estoy listo para aprovechar mis habilidades y experiencia para impulsar el éxito de tu próximo proyecto de desarrollo web!\n",
  "about1": "¡Hola! Soy un apasionado desarrollador web con 4 años de experiencia, especializado en la creación de aplicaciones web dinámicas y eficientes. A lo largo de mi carrera, he participado en numerosos proyectos colaborativos, destacando en el desarrollo de sistemas de mensajería y paquetería, así como en la implementación de plataformas de comercio electrónico.",
  "about2": "Mi experiencia se centra en el uso de tecnologías avanzadas como Laravel y Vue.js, permitiéndome desarrollar soluciones web robustas y escalables. Me caracterizo por ser una persona empática y responsable, siempre en busca de nuevos desafíos y oportunidades para seguir aprendiendo y mejorando mis habilidades..",
  "cv_text": "Show CV",
  "present": "Actual",
  "links": {
    "about": {
      "name": "about",
      "text": "Sobre mí",
      "href": "#about"
    },
    "experience": {
      "name": "experience",
      "text": "Experiencia",
      "href": "#experience"
    },
    "works": {
      "name": "projects",
      "text": "Proyectos",
      "href": "#projects"
    },
    "technologies": {
      "name": "technologies",
      "text": "Tecnologias que uso",
      "href": "#technologies"
    },
    "certificates": {
      "name": "certificates",
      "text": "Certificados",
      "href": "#certificates"
    },
    "cv": {
      "name": "cv",
      "text": "Ver CV",
      "href": "/David_Villeda_CV_ES.pdf",
      "target": "_blank"
    }
  },
  "experience": {
    "threejs-module": {
      "description": "Desarrollé un avanzado módulo de personalización de cajas utilizando la librería Three.js de JavaScript para el sitio web de KJOTA. Este módulo permite a los clientes visualizar de manera intuitiva y eficaz cómo se vería la impresión de su logotipo en nuestras cajas mediante un modelo 3D interactivo, accesible desde su dispositivo móvil o computadora."
    },
    "theboxboss": {
      "description": "Encabecé el desarrollo desde cero de un e-Commerce para The Box Boss, una empresa gestionada por KJOTA que se especializa en la venta de cajas de cartón y materiales de embalaje en Estados Unidos. Este proyecto abarcó todas las etapas del desarrollo, desde la conceptualización hasta la implementación. "
    },
    "kjota": {
      "description": "Lideré el desarrollo desde cero de un e-Commerce para KJOTA, una empresa especializada en la venta de cajas de cartón y materiales de embalaje. Este proyecto abarcó todo el ciclo de desarrollo, desde la conceptualización hasta la implementación. El e-Commerce está diseñado exclusivamente para compras y envíos dentro del Estado de México y Ciudad de México, con planes para expandir su cobertura en el futuro."
    },
    "boxitup": {
      "description": "Responsable del desarrollo de un sistema web de personalización de cajas de cartón para una sucursal de KJOTA, una empresa dedicada a la manufactura de cajas de cartón y la venta de materiales de embalaje. Este proyecto se inspiró en el concepto de “Build a Bear”, pero orientado a la personalización de cajas de cartón mediante serigrafía."
    },
    "bullet-delivery": {
      "description": "Desarrollé, junto con un equipo de trabajo, una aplicación móvil para el sistema web de Bullet Envios, orientada a sus repartidores. La aplicación, desarrollada en Flutter, tenía como objetivo mejorar el seguimiento de los paquetes y optimizar la eficiencia de los repartidores. Mediante la aplicación, los repartidores podían actualizar el estado del paquete escaneando un código QR y nproporcionar a los clientes un mejor tracking. Además, la aplicación ofrecía rutas de recolección y entrega integradas con Google Maps, mejorando la precisión y puntualidad de los servicios de paquetería."
    },
    "bullet-envios": {
      "description": "Lideré el desarrollo, junto con un equipo de trabajo, un sistema web de paquetería y mensajería que operaba en selectas zonas del Estado de México y Ciudad de México. El sistema, diseñado con interfaces tanto para clientes como para administradores, mejoró significativamente la eficiencia y la experiencia del usuario en la gestión de envíos."
    },
    "dastur": {
      "description": "Durante mis prácticas profesionales en D’ ASTUR SA de CV, desarrollé un sistema de control de producción para optimizar la gestión de la manufactura de cajas de cartón. El objetivo principal del proyecto fue reducir la generación de merma y mejorar la planificación y los tiempos de entrega de las órdenes de compra."
    },
    "satoritech": {
      "description": "Responsable del diseño y desarrollo web de aplicaciones y sistemas para pequeñas y medianas empresas (PyMES). Mi trabajo se centró en crear interfaces de usuario intuitivas y funcionales, asegurando una experiencia de usuario óptima y cumpliendo con los requisitos específicos de cada cliente, utilizando de base y en colaboracion con un equipo una maquetacion en Adobe XD."
    },
    "government": {
      "title": "Gobierno",
      "description": "Durante mi servicio social, desarrollé un sistema web integral que facilitó el registro y la selección de aspirantes a becas. Este sistema optimizó el proceso administrativo, mejorando la eficiencia en la gestión de becas otorgadas por la administración de ese año."
    }
  },
  "more-text": "Mostrar mas",
  "projects": {
    "laravel-reverb-chat": {
      "description": "Este proyecto simula un chat en tiempo real entre los usuarios de tu sistema utilizando Laravel Reverb. Los usuarios pueden enviar y recibir mensajes instantáneamente, creando una experiencia de chat dinámica y colaborativa. Con Laravel Reverb, la aplicación aprovecha las capacidades de WebSockets para asegurar una comunicación rápida y sin interrupciones. Ideal para practicar habilidades de desarrollo en Laravel, manejo de eventos en tiempo real y creación de interfaces de usuario interactivas."
    },
    "indecision-app": {
      "description": "Haz tu pregunta (¡asegúrate de terminar con un signo de interrogación!) y deja que una API externa decida tu destino con un Sí, No, o Tal vez, según la suerte. Cada respuesta viene con un GIF animado para hacerlo más divertido. Con una interfaz de chat realista, es ideal para decisiones rápidas o simplemente pasar un buen rato. ¿Te Atreves a preguntar?"
    },
    "shadow-pokemon-quiz": {
      "description": "Ponte a prueba y descubre qué Pokémon se oculta detrás de la sombra. Simplemente selecciona el Pokémon correcto de la lista de opciones. Si aciertas, recibirás un mensaje de correcto. Si fallas, no te preocupes, puedes intentarlo tantas veces como quieras."
    },
    "sphere-js": {
      "description": "Explora un proyecto de práctica donde visualizamos la población global en un modelo tridimensional del planeta. Cada país se representa con precisión, permitiendo un viaje educativo y visualmente impactante a través del mundo. Ideal para aplicar conocimientos de desarrollo web y visualización de datos geoespaciales usando Three Js."
    },
    "colective-journal": {
      "description": "En este proyecto, los usuarios pueden crear una cuenta en Firebase utilizando correo y contraseña para autenticarse. Todos los usuarios comparten una misma colección de escritos, creando un espacio colaborativo donde cada uno puede escribir sus pensamientos y reflexiones. Estos escritos se guardan en una Realtime Database, proporcionando un espacio seguro y accesible para todos. Ideal para practicar habilidades de autenticación, CRUD y colaboración en tiempo real usando Firebase."
    }
  },
  "less-text": "Menos",
  "certificates": {
    "certificate": "Certificado",
    "course": "Curso",
    "microsoft": {
      "az900": {
        "title": "Certificado Microsoft: Fundamentos de Azure AZ-900",
        "description": "Este certificado valida mi conocimiento de los conceptos fundamentales de la computación en la nube y los servicios de Microsoft Azure."
      }
    },
    "mercatitlan": {
      "google-ads": {
        "title": "Curso Google Ads",
        "description": "El curso en línea de Google Ads de Juan Lombana enseña desde los conceptos básicos hasta estrategias avanzadas de publicidad en Google. Cubre la creación y optimización de campañas, uso efectivo de palabras clave y estructuración de anuncios para maximizar el retorno de inversión."
      }
    }
  },
  "skills": {
    "test": "Pruebas",
    "version-control": "Control de versiones",
    "deploy": "Alojamiento web"
  },
  "404": {
    "description": "Parece que la pagina o recurso que estás buscando no está disponible, o quizas...",
    "list": {
      "one": "Lo hayas eliminado accidentalmente",
      "two": "Nunca existio",
      "three": "Aún esta en construcción\n"
    },
    "farewell":{
      "description": "Como sea... sientete libre de explorar o de volver a la",
      "link": "página principal"
    }
  },
  "language": {
    "english": "Inglés",
    "spanish": "Español"
  },
  "months": {
    "january": "Enero",
    "february": "Febrero",
    "march": "Marzo",
    "april": "Abril",
    "may": "Mayo",
    "june": "Junio",
    "july": "Julio",
    "august": "Agosto",
    "september": "Septiembre",
    "october": "Octubre",
    "november": "Noviembre",
    "december": "Diciembre"
  }
}